content/posts/wenzel2018/index.md
+++
title = "Wenzel2018"
author = ["Wenzel", "Makarius"]
date = 2025-01-14T11:54:00+01:00
draft = false
+++

## Isabelle/jEdit as IDE for Domain-specific Formal Languages and Informal Text Documents {#isabelle-jedit-as-ide-for-domain-specific-formal-languages-and-informal-text-documents}

Makarius Wenzel explores the use of Isabelle/JEdit as a IDE for both formal
languages and informal text documents.

First of all, Isabelle is an interactive theorem proving system, and JEdit is a
text editor written in Java. Isabelle/JEdit combines both as a front-end for the
Prover IDE (PIDE). This editor aims to support users in reading and writing
proof documents with continuous background checking by the prover.
